Revit 2026 API

# BumpMapBumpmapBitmap Property

---

The property labeled "Source" from the "BumpMap" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string BumpmapBitmap { get; }
```
```vb
Public Shared ReadOnly Property BumpmapBitmap As String
	Get
```
```cpp
public:
static property String^ BumpmapBitmap {
	String^ get ();
}
```
```fsharp
static member BumpmapBitmap : string with get
```

#### Property Value

String

This property is of type "AssetPropertyString" and will contain a relative path.

#### Reference

BumpMap Class

Autodesk.Revit.DB.Visual Namespace